content-org/pde-simulate-on-web-with-rust/index.org
#+TITLE: Simulating PDEs on Web with Rust 
#+AUTHOR: Trent Fridey
#+DATE: 2021-01-04
#+HUGO_BASE_DIR: ~/trent/blog
#+HUGO_SECTION: posts/pde-simulate-on-web-with-rust
#+HUGO_TAGS: rust webassembly PDEs front-end
#+HUGO_DRAFT: true

We can use Rust and WebAssembly to simulate the solution to partial differential equations, using the browser as a front end.

In this post, we will implement a finite-difference solver in Rust that will compile to WebAssembly.

* Wait but why

  There are many, many ways to efficiently implement a finite-difference solver.
  Even with JavaScript, we may be able to do so efficiently by leveraging the canvas APIs.
  The benefit of using Rust is that we might be able to avoid the speed bottleneck of the canvas API by using lower-level APIs, while still having some guarantees about safety.

* Theoretical Background

  We will be solving the following PDE:

  # INSERT CHOSEN PDE HERE
  # ALSO INSERT BOUNDARY

  
#+begin_src rust

#+end_src
